/*
 * main.c
 *
 *  Created on: 18 мая 2017 г.
 *      Author: shaveinikovds
 */

/*
 Написать функцию bsearch, которая принимает на вход отсортированный по неубыванию массив
 целых чисел и целое число x. В качестве результата функция должна возвращать индекс первого
 элемента массива, строго большего x. В Вашей реализации функция может принимать любое
 количество любых параметров, только 2 этих параметра обязательны. При использовании Вашей
 функции должна быть возможность определить, существует ответ или нет. В качестве решения
 пришлите ссылку на репозиторий с программой на языке C с примером использования функции.
 */
#include "stdlib.h"
#include "stdio.h"
#define SZ 10

typedef enum { false, true } bool;

//TODO: task five in this branch


int main()
{



    return 0;
}
